package den.bogdanov.sidedishrecipe;

public class Utils {

    public static final String SIDE_DISH_1_TITLE = "Греческий салат. Классический вариант";
    public static final String SIDE_DISH_1_DESCRIPTION = "Греческий салат – отличный вариант простого и легкого овощного салата, который будет незаменимым и на праздничном, и на повседневном столе.";
    public static final String SIDE_DISH_1_RECIPE = "Любителям овощных салатов понравится рецепт, как приготовить греческий салат классический в в домашних условиях, не хуже, чем в ресторане. Для приготовления этого салата нам понадобятся овощи, а именно: Огурец - 1 шт, Помидор - 2 шт, Сладкий перец - 1 шт, Красный лук - 1 шт, Сыр мягких сортов к примеру Фета - 100 гр, Оливки - 50гр, Орегано - 1/2 ч.ложки Щепетка соли. Для заправки используем оливковое масло 3 ст. ложки Далее приготовление проще простого, нарезаем овощи и смешиваем все ингредиенты. Подать салат можно к запеченому мясу и любым горячим блюдам";

    public static final String SIDE_DISH_2_TITLE = "Салат из куриной грудки с ананасом";
    public static final String SIDE_DISH_2_DESCRIPTION = "Салат простой, но очень вкусный. Ананас придает блюду необычный сладковатый привкус и хорошо сочетается с куриным филе ";
    public static final String SIDE_DISH_2_RECIPE = "Для данного салата нам понадобится: Грудка куриная (отварная) - 1 шт Отварные яйца - 2 шт, Кукуруза консервированная - 3-4 ст ложки, Ананас консервированный - 200 гр, Сыр твердый - 30 гр, Зелень для украшения, Майонез (в качесвте заправки) - 150 млДля начала приготовим все ингредиенты грудку и яйца предварительно отварить и остудить. Далее, грудку нарезаем поперек волокон и отправляем в салатницу, к ней добавляем кукурузу, ананас (нарезаем кубиками), сыр (кубиками). Белок отделяем от желтка, нарезаем и тоже отправлем в салатницу. Добавляем майонез и перемешиваем. Готовый салат выкладываем на тарелку с помощью кольца для формовки. Верх посыпаем натертым на терке желтком и украшаем зеленью. Даем салату немного постоять в холодильнике, и можем подавать к столу.  ";

    public static final String SIDE_DISH_3_TITLE = "Салат Красное море. Пятиминутка";
    public static final String SIDE_DISH_3_DESCRIPTION = "Быстро, вкусно и красиво!";
    public static final String SIDE_DISH_3_RECIPE = "Ингредиенты: Крабовые палочки - 250 - 300 гр Помидоры - 1-2 шт Сыр твердый - 100 - 200 гр Чеснок - 1 - 3 зубчика Майонез в качестве заправки Соль по вкусуПриготовение: Сыр натереть на терке Помидоры порезать соломкой Крабовые палочки нарезаем тонкими колечками Чеснок мелко нарезать  Соединяем все ингредиенты в салатнице заправляем майонезом, хорошо перемешиваем и подаем к столу";

    public static final String SIDE_DISH_4_TITLE = "Салат морковный с кириещками и чесноком";
    public static final String SIDE_DISH_4_DESCRIPTION = "Бюджетный салат с пикантным вкусом чесночка";
    public static final String SIDE_DISH_4_RECIPE = "Ингредиенты: Морковь - 2 шт Плавленный сырок - 1 шт Чеснок - 2 зубчика Кириешки - 1 упаковкаМайонез в качестве заправкиПриготовление: Морковь и плавленный сырок пропускаем на терке, чеснок через пресс или мелко шенкуем. В салатнице соединяем ингредиенты с майонезом и кириешками. Салат готов. Подавать следует сразу, пока не размокли кириешки. Хорошо подходит к отварному картофелю";

    public static final String SIDE_DISH_5_TITLE = "Салат Мимоза. Слоеный";
    public static final String SIDE_DISH_5_DESCRIPTION = "Салат Мимоза – очень красивое блюдо. А поскольку салат готовится достаточно просто, то его часто можно увидеть на праздничном столе";
    public static final String SIDE_DISH_5_RECIPE = "Ингредиенты: Рыба (сайра) консервированная - 1 шт, Лук репчатый - 1 шт, Куриные яйца (отварные) - 2 шт, Сыр твердых сортов - 100 гр, Морковь (отварная) - 2 шт, Картофель ( отварной) - 2 шт, В качестве заправки выступает наш любимый майонез. Соль и зелень по вкусу и желанию. Приготовление: Предварительно отвариваем овощи остужаем и чистим натераем их на терке, лук мелко шинкуем, желкок измельчаем вилкой, а белок пропускаем через крупную терку,рыбу растераем вилкой. Итак, переходим к построению слоев. На дно салатницы выкладываем рыбку ( первый слой), и слой майонеза, второй слой - картофель и лук и закрываем майонезом, третий слой натертый белок, сыр и майонез. Финальный слой морковь без майонеза. Для красоты можно украсить веточкой петрушки или укропа. Салат готов.";

}
